$(document).ready(function () {
// emoji text hover
const emojis = ["😀", "😃", "😄", "😁", "😆", "😅", "😂", "🤣", "☺️", "😊", "😇", "🙂", "🙃", "😉", "😌", "😍", "😘", "😗", "😙", "😚", "😋", "😜", "😝", "😛", "🤑", "🤗", "🤓", "😎", "🤡", "🤠", "😏", "😒", "😞", "😔", "😟", "😕", "🙁", "☹️", "😣", "😖", "😫", "😩", "😤", "😠", "😡", "😶", "😐", "😑", "😯", "😦", "😧", "😮", "😲", "😵", "😳", "😱", "😨", "😰", "😢", "😥", "🤤", "😭", "😓", "😪", "😴", "🙄", "🤔", "🤥", "😬", "🤐", "🤢", "🤧", "😷", "🤒", "🤕"]
var random;
var randomTemp;
$('.rotate-emoji').mouseover(function () {
    random = Math.floor(Math.random() * emojis.length) + 1
    if (random == randomTemp) {
        random = Math.floor(Math.random() * emojis.length) + 1
    }
    randomTemp = random;
    setTimeout(function () {
        $('.rotate-emoji').html(emojis[random]);
    }, 100);

})
});
